{
  "mainName": "Brother Corhyn",
  "firstAppearance": "Roundtable Hold",
  "laterAppearances": ["Atlus Plateau", "Leyndell"],
  "alsoInvolved": ["Goldmask"],
  "questLocations": ["Roundtable Hold", "Atlus Plateau", "Leyndell"],
  "mainImage": "/vendors/img/npc/roundtable-hold/brother-corhyn.png",
  "questline": {
    "1": {
      "step": "First encounter at Roundtable Hold",
      "description": "The first time the player can encounter Brother Corhyn is at Roundtable Hold.",
      "images": []
    },
    "2": {
      "step": "First encounter at Atlus Plateau",
      "description": "As soon as you reach Atlus Plateau, when speaking to Brother Corhyn, he will tell you he is heading onto a journey trying to find the Goldmask. He moves to Atlus Plateau after resting.",
      "images": []
    }
  },
  "3": {
    "step": "Finding the Goldmask",
    "description": "After talking with Brother Corhyn nearby the Atlus Highway Junction site of Grace, you have to find Goldmask. He is standing on the north section of the Forest-Spanning Great Bridge, south of East Windmill Pasture. After you interact with Goldmask, you can go back to Corhyn and tell him Goldmask's whereabouts. After resting, he will move to where you found Goldmask.",
    "images": []
  },
  "4": {
    "step": "The riddle",
    "description": "In order to progress this questline, you need to obtain at least two Great Runes and have access to Leyndell. Both Goldmask and Corhyn will move to Leyndell, and can be found on a cliff up west of the colosseum. You need to exhaust Corhyn's dialogue. IMPORTANT: You need to solve this riddle before burning the Erdtree at Forge of the Giants - otherwise, Corhyn will vanish and leave behind his bell bearing, and Goldmask will not be present. The solution is as follows: First, you need to travel west of the Erdtree Sanctuary site of grace, down an elevator and a set of stairs. A white message on the ground facing the statue mentions 'Regression'. You must stand on the message, facing the statue, and cast the Law of Regression incantation to solve the riddle. Touch the new message that appears, and report the secret to Goldmask and then exhaust Corhyn's dialogue. ",
    "images": []
  },
  "5": {
    "step": "Stargazer's Ruins",
    "description": "After leaving Goldmask and Brother Corhyn (reloading the area will not work), they will move to the bridge south of Stargazer's Ruins right above the Ancient Snow Valley Ruins site of grace. You might give Corhyn Tonic of Forgetfulness, but he will refuse the potion. It will change the final outcome of the questline.",
    "images": []
  },
  "6": {
    "step": "Post Farum-Azula - Goldmask ending",
    "description": "After completing Farum Azula (defeating Maliketh), you can find Goldmask in Leyndell, Ashen Capital. He moves to the bottom of the colosseum cliffs facing the west side of the Erdtree Sanctuary site of grace. He will give you the Mending Rune of Perfect Order. Reload the area to loot Goldmask's Set.",
    "images": []
  },
  "7": {
    "step": "Post Farum-Azula - Corhyn ending",
    "description": "Corhyn can be found in on of the possible two locations: First location - he should be at the base of the giant spiral spear. After you exhaust his dialogue and reload the area, you can find a Flail, Corhyn's Bell Bearing and his robe where he was sitting. Second possible location: if you offered him the Tonic of Forgetfulness, he will remain at the bridge south of the Stargazers' Ruins where you last saw him. Talk to him; he'll be unaware of Goldmask's absence. Reload the area and then collect all three of the above items where he was. If you don't complete the questline, you can find his bell bearing and robe ona cliff west of the colosseum in the Ashen Capital.",
    "images": []
  }
}
